{
  "backend/main.mo": "Empty Motoko actor with no backend logic; deployment handled externally.",
  "feature_evidence.json": "Feature evidence report listing feature descriptions, related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "JSON-style text summarizing frontend files and components for build planning.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites, IC naming rules, and standard deployment steps.",
  "frontend/index.css": "Global Tailwind and OKLCH theme configuration defining light and dark color tokens and base styles.",
  "frontend/index.html": "Basic HTML entry file mounting the React app via main.tsx.",
  "frontend/public/google81cfc97330838765.html": "Google site verification file for ownership validation.",
  "frontend/scripts/build-with-diagnostics.mjs": "Node diagnostic build script running TypeScript checks and Vite build with colored logging and troubleshooting.",
  "frontend/scripts/retry-deploy.sh": "Bash script automating clean redeployment with name validation, cleanup steps, and error trapping.",
  "frontend/scripts/validate-deploy-names.mjs": "Node script validating IC canister naming rules in dfx.json and canister_ids.json.",
  "frontend/src/App.tsx": "Main React app component managing search, cart state, and layout composition for all major sections.",
  "frontend/src/components/ActionableError.tsx": "Displays an error message with optional primary and secondary action buttons.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches errors and shows an actionable error with a page refresh option.",
  "frontend/src/components/CartDrawer.tsx": "Slide-out cart UI showing items, totals, removal controls, and a WhatsApp checkout button.",
  "frontend/src/components/Footer.tsx": "Website footer with company info, quick links, social icons, and a dynamic copyright.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search input, and cart button showing item count.",
  "frontend/src/components/Hero.tsx": "Hero banner with background image, headline, and a button that scrolls to the products section.",
  "frontend/src/components/NoticeBar.tsx": "Scrolling marquee bar displaying repeated service time notices.",
  "frontend/src/components/ProductCard.tsx": "Product card with image fallback logic, rating display, quantity controls, and cart or WhatsApp purchase actions.",
  "frontend/src/components/ProductGrid.tsx": "Filters and displays a predefined list of products using ProductCard components based on the search query.",
  "frontend/src/components/ReviewsSection.tsx": "Displays customer reviews and a form to submit new ones using local state and UI components.",
  "frontend/src/components/TrustSection.tsx": "Renders a trust banner with safe checkout text and payment method icons.",
  "frontend/src/components/WhatsAppButton.tsx": "Provides a floating WhatsApp contact button linking to a predefined phone number.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines a placeholder example React Query hook that depends on the actor.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables, dark mode values, and utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and plugin setup.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related build files like Vite and scripts.",
  "frontend/vite.config.ts": "Vite configuration with React, aliasing, build settings, chunk splitting, and dev server proxy.",
  "project_state.json": "Tracks project metadata, storefront requirements, assets, and known deployment issues."
}