{
  "backend/main.mo": "Placeholder Motoko canister with no functional backend logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites, IC naming rules, and standard deployment steps.",
  "frontend/index.css": "Global Tailwind-based style definitions including color variables and dark mode overrides.",
  "frontend/index.html": "Base HTML entry point loading the React app via main.tsx.",
  "frontend/scripts/build-with-diagnostics.mjs": "Node script that runs TypeScript checks and Vite build with colored diagnostic output.",
  "frontend/scripts/retry-deploy.sh": "Deployment retry script that validates names, cleans build/dfx state, and redeploys canisters with error guidance.",
  "frontend/scripts/validate-deploy-names.mjs": "Node script validating IC naming rules in dfx.json and canister_ids.json with detailed error messages.",
  "frontend/src/App.tsx": "Main React app wiring together search, cart state, product grid, UI sections, and theme provider.",
  "frontend/src/components/ActionableError.tsx": "UI component that displays an error message with optional primary and secondary action buttons.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches app errors and shows an ActionableError with a refresh option.",
  "frontend/src/components/CartDrawer.tsx": "Slide-out cart panel showing items, total price, removal controls, and WhatsApp checkout.",
  "frontend/src/components/Footer.tsx": "Footer with company info, quick links, social icons, and a Caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Top navigation bar with logo, search input, and cart button showing item count.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline, and a button that scrolls to the products list.",
  "frontend/src/components/NoticeBar.tsx": "Scrolling marquee displaying repeated service time information.",
  "frontend/src/components/ProductCard.tsx": "Product display card with image, rating, pricing, quantity controls, and buy/add-to-cart actions.",
  "frontend/src/components/ProductGrid.tsx": "Product listing grid that filters products by search query and renders ProductCard components.",
  "frontend/src/components/ReviewsSection.tsx": "A reviews component that displays customer reviews and allows users to submit new ones via a form with validation and toast feedback.",
  "frontend/src/components/TrustSection.tsx": "A simple section showing a safe checkout message and payment method icons.",
  "frontend/src/components/WhatsAppButton.tsx": "A floating WhatsApp contact button linking to a predefined phone number.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity authentication, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity restoration, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder React Query hook that prepares for future backend queries using the actor.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH theme variables, dark mode definitions, and utility animations.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and enabling plugins for typography, container queries, and animations.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related scripts using ESNext modules and bundler resolution.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, path aliasing, dev server proxy, and manual chunking for optimized builds.",
  "project_state.json": "Tracks project version, storefront requirements, architecture notes, known issues, and required assets for the subscription store."
}