{
  "backend/main.mo": "Placeholder Motoko actor with no backend logic, as deployment workflow is handled externally.",
  "feature_evidence.json": "Feature evidence report describing addition of locally stored product logo assets referenced in ProductGrid.",
  "frontend-file-summaries.txt": "Collection of summaries for all major frontend components, hooks, styles, and deployment scripts.",
  "frontend/DEPLOYMENT.md": "Guide detailing IC deployment prerequisites, naming rules, steps, and common issues.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables and dark mode theming.",
  "frontend/index.html": "Minimal HTML entry point mounting the React app and loading main.tsx.",
  "frontend/public/google81cfc97330838765.html": "Google site verification file for domain ownership validation.",
  "frontend/scripts/build-with-diagnostics.mjs": "Node script running TypeScript checking and Vite build with colored diagnostic output.",
  "frontend/scripts/retry-deploy.sh": "Shell script automating deployment retries with name validation, cleanup, and error guidance.",
  "frontend/scripts/validate-deploy-names.mjs": "Node script validating IC canister naming rules in dfx.json and canister_ids.json.",
  "frontend/src/App.tsx": "Main React app wiring search, cart, layout sections, theming, and error boundary.",
  "frontend/src/components/ActionableError.tsx": "UI component showing actionable error messages with retry buttons.",
  "frontend/src/components/AppErrorBoundary.tsx": "React error boundary that catches errors and displays ActionableError with refresh option.",
  "frontend/src/components/CartDrawer.tsx": "Slide‑in cart drawer showing items, totals, and a WhatsApp checkout flow with item removal.",
  "frontend/src/components/Footer.tsx": "Footer with company info, links, social icons, and a dynamic year plus referral link.",
  "frontend/src/components/Header.tsx": "Sticky header with logo, search input, and cart button showing item count badge.",
  "frontend/src/components/Hero.tsx": "Hero section with background image, headline, and a button scrolling to products.",
  "frontend/src/components/NoticeBar.tsx": "Scrolling marquee bar displaying service time notices.",
  "frontend/src/components/ProductCard.tsx": "Product card with image handling, quantity controls, price actions, and WhatsApp interactions.",
  "frontend/src/components/ProductGrid.tsx": "Grid filtering and displaying product cards from a predefined product list.",
  "frontend/src/components/ReviewsSection.tsx": "Customer reviews list with a form to submit new reviews and star ratings.",
  "frontend/src/components/TrustSection.tsx": "Trust badge section highlighting secure checkout with payment method icons.",
  "frontend/src/components/WhatsAppButton.tsx": "Floating WhatsApp button linking to customer support chat.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity authentication, including login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines placeholder query logic using the actor, currently returning null until backend calls are added.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode settings, and utility animations including marquee and icon display rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, radius, and plugins like typography and container queries.",
  "frontend/tsconfig.node.json": "TypeScript config for Node-related tooling with module resolution and composite build options.",
  "frontend/vite.config.ts": "Vite config for React with path aliases, chunk splitting, dev server proxy, and optimization settings.",
  "project_state.json": "Tracks project metadata, requirements, features, and deployment issues for the storefront system."
}