{
  "kind": "build_request",
  "title": "Expand catalog, remove 3-month option, add Messenger group link, and hide prices for non-Netflix/Chess items",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-24",
      "text": "Remove the “3 Month” duration option across the storefront and keep only a single “1 Month” duration for all products and cart items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove 3 month option,"
        ]
      },
      "acceptanceCriteria": [
        "Product cards no longer render a duration toggle with “3 Month”.",
        "Cart items no longer store or display a “3 Month” duration value; the duration is always “1 Month”.",
        "WhatsApp message generation for Buy Now/Checkout no longer includes a selectable duration beyond “1 Month”.",
        "TypeScript types compile without union types that include “3 Month”."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Add a visible “Investigation / Proof (Messenger Group)” link in the storefront UI that opens the Messenger group join URL in a new tab: https://m.me/j/AbZu2osHvaTmS0WN/",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a messenger group joining link for investigation, proof .  Link:- https://m.me/j/AbZu2osHvaTmS0WN/"
        ]
      },
      "acceptanceCriteria": [
        "A link labeled exactly “Investigation / Proof (Messenger Group)” is visible in the UI (e.g., Footer Quick Links section).",
        "Clicking the link opens https://m.me/j/AbZu2osHvaTmS0WN/ in a new tab with proper rel attributes (noopener/noreferrer)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Expand the product catalog to include the following additional services in the product grid: ChatGPT, Gemini, Facebook, Toffee, Chorki, Deepto Pay, Bioscope, iScreen, Hoichoi, PUBG, Free Fire, Adobe Creative, Canva, Truecaller, CamScanner. Each new service must display its official logo image on the product card.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add more options like , chatgpt, gemini, Facebook, toffee, chorki, deepto pay, bioscope, iscreen,hoichoi, pubge , freefire ,adobe creative, canva , true caller , cam scanner ,  with their official logo"
        ]
      },
      "acceptanceCriteria": [
        "All listed new services appear as cards in the product grid and are discoverable via the existing search filter.",
        "Each new service card displays an image loaded from a static asset under /assets/generated/ and falls back to the placeholder initial if the image fails to load.",
        "No existing products are removed from the grid unless explicitly required by other requirements."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Restrict visible numeric pricing to only Chess.com Diamond Membership and Netflix Premium. For all other products (including existing Spotify and YouTube Premium, plus all newly added services), hide numeric prices and instead show clickable “(prize)” text that opens WhatsApp (https://wa.me/8801326060586) with a pre-filled query message for that product.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "with their official logo & hide prizes in those... And fill with this text (prize) and (prize) tab link with WhatsApp,,, if anyone click on prize it will direct to WhatsApp for queries..",
          "Only show chess. Com & netflix prizes"
        ]
      },
      "acceptanceCriteria": [
        "Only Netflix Premium and Chess.com Diamond Membership show crossed-out original price, current price, and total price values in Tk.",
        "Spotify, YouTube Premium, and all newly added services do not display any numeric currency values anywhere on the product card (including totals).",
        "For non-priced products, the UI shows exactly “(prize)” in the price area, styled like a link/button, and clicking it opens https://wa.me/8801326060586 in a new tab with a URL-encoded message that includes at least the product name and a “price inquiry” intent.",
        "Non-priced products do not allow Add to Cart/Buy It Now flows that require numeric totals; if those actions remain visible, they must route to the same WhatsApp inquiry behavior without showing numeric amounts."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Ensure the Chess.com product card uses an official Chess.com logo asset (replacing the current Chess.com artwork if needed) and update the product data to reference the new asset path consistently.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add chess.com official logo ,,"
        ]
      },
      "acceptanceCriteria": [
        "Chess.com Diamond Membership displays the updated Chess.com logo from /assets/generated/ without broken images.",
        "The product’s image path in the product data matches the generated filename exactly and is used by ProductCard’s <img> rendering.",
        "If an uploaded reference image was provided, the generated asset visually matches it (clean, logo-like, transparent/flat-friendly)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text (except the literal requested “(prize)” string, which must remain exactly as requested).",
    "Do not edit any files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request.",
    "All logos must be served as static assets from frontend/public/assets/generated and referenced by path from product data.",
    "Preserve the existing WhatsApp base URL: https://wa.me/8801326060586.",
    "Preserve the provided Messenger group join URL exactly: https://m.me/j/AbZu2osHvaTmS0WN/."
  ],
  "nonGoals": [
    "Implementing real payments or a backend-driven product catalog.",
    "Third-party authentication beyond existing Internet Identity scaffolding.",
    "Creating or integrating real-time chat or Messenger APIs.",
    "Adding multi-page routing or a separate admin panel."
  ],
  "imageRequirements": {
    "required": [
      "Chess.com official-style logo on transparent background (chesscom-logo-official.dim_512x512.png)",
      "ChatGPT official-style logo on transparent background (chatgpt-logo.dim_512x512.png)",
      "Gemini official-style logo on transparent background (gemini-logo.dim_512x512.png)",
      "Facebook official-style logo on transparent background (facebook-logo.dim_512x512.png)",
      "Toffee official-style logo on transparent background (toffee-logo.dim_512x512.png)",
      "Chorki official-style logo on transparent background (chorki-logo.dim_512x512.png)",
      "Deepto Pay official-style logo on transparent background (deeptopay-logo.dim_512x512.png)",
      "Bioscope official-style logo on transparent background (bioscope-logo.dim_512x512.png)",
      "iScreen official-style logo on transparent background (iscreen-logo.dim_512x512.png)",
      "Hoichoi official-style logo on transparent background (hoichoi-logo.dim_512x512.png)",
      "PUBG official-style logo on transparent background (pubg-logo.dim_512x512.png)",
      "Free Fire official-style logo on transparent background (freefire-logo.dim_512x512.png)",
      "Adobe Creative official-style logo on transparent background (adobe-creative-logo.dim_512x512.png)",
      "Canva official-style logo on transparent background (canva-logo.dim_512x512.png)",
      "Truecaller official-style logo on transparent background (truecaller-logo.dim_512x512.png)",
      "CamScanner official-style logo on transparent background (camscanner-logo.dim_512x512.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text"
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}