{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update subscription product logos, Chess.com duration/pricing, and WhatsApp/cart consistency",
  "requirements": [
    {
      "id": "REQ-36",
      "summary": "Update Chess.com product to use the specified remote logo URL, a single \"1 Year\" duration, and BDT pricing (1200 regular / 970 offer used for totals) across card, cart, and WhatsApp message.",
      "acceptanceCriteria": [
        "Chess.com card shows crossed-out regular price \"BDT 1200\" and current/offer price \"BDT 970\".",
        "Chess.com card’s total price calculation uses offer price (970) × quantity and displays as \"BDT\" (not \"Tk\") for Chess.com.",
        "Chess.com product has a single duration option labeled exactly \"1 Year\" (no month-based label shown for Chess.com).",
        "Clicking Chess.com “Buy It Now” opens WhatsApp with a pre-filled message containing Product name, Duration: 1 Year, Quantity, and Total in BDT.",
        "Adding Chess.com to cart stores duration as \"1 Year\" and cart UI/checkout message shows \"1 Year\" (not \"1 Month\") for that item."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductGrid.tsx",
          "operation": "modify",
          "description": "Update the Chess.com Diamond Membership product configuration: set image to the exact remote logo URL provided, set regular/original price to 1200 and offer/current+unit price to 970, and provide product metadata so Chess.com uses a single duration labeled exactly \"1 Year\" and currency label \"BDT\"."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Stop hardcoding \"1 Month\" and \"Tk\" for priced products; read duration label and currency label from product data so Chess.com displays and calculates totals as BDT with duration \"1 Year\", and ensure the WhatsApp Buy It Now message includes Product, Duration, Quantity, and Total in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update CartItem typing/model so cart items can store per-product duration (e.g., \"1 Year\") and currency label (e.g., \"BDT\") rather than a fixed \"1 Month\" assumption."
        },
        {
          "path": "frontend/src/components/CartDrawer.tsx",
          "operation": "modify",
          "description": "Render cart line items and the WhatsApp checkout message using each item's stored duration and currency label (show \"1 Year\" and \"BDT\" for Chess.com), and keep all user-facing text in English."
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add Chess.com logo fallback: if the remote Chess.com logo fails, display a local generated asset from frontend/public/assets/generated without showing a broken image icon.",
      "acceptanceCriteria": [
        "When the Chess.com remote image fails to load (simulated by blocking the URL), the product card displays the local fallback image from `/assets/generated/...` instead of the letter placeholder or a broken image.",
        "When the remote URL loads successfully, the local fallback is not used.",
        "All user-facing alt text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/chesscom-logo-remote-fallback.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated static fallback asset required for Chess.com remote-logo failure handling: frontend/public/assets/generated/chesscom-logo-remote-fallback.dim_512x512.png."
        },
        {
          "path": "frontend/src/components/ProductGrid.tsx",
          "operation": "modify",
          "description": "Augment Chess.com product data to include a local fallback image path referencing frontend/public/assets/generated/chesscom-logo-remote-fallback.dim_512x512.png and ensure the primary image remains the exact remote URL."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Implement image error handling so Chess.com first tries the remote logo URL and, on error, swaps to the local fallback (/assets/generated/chesscom-logo-remote-fallback.dim_512x512.png) without rendering a broken image icon; only fall back to the letter placeholder if both fail."
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Refresh Netflix, Spotify, and YouTube Premium logos to official high-resolution branding served from frontend/public/assets/generated and referenced consistently from ProductGrid.",
      "acceptanceCriteria": [
        "Netflix, Spotify, and YouTube Premium cards display official, high-resolution logos with transparent/clean backgrounds suitable for the premium dark theme.",
        "The logo assets are served as static files from `frontend/public/assets/generated/` and referenced via stable `/assets/generated/...` paths in `frontend/src/components/ProductGrid.tsx`.",
        "No external runtime dependency is required to render these three logos (i.e., the logos still render when offline once the app is loaded)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/netflix-logo.dim_512x512.png",
          "operation": "modify",
          "description": "Replace/update the generated Netflix logo file to the official high-resolution branding asset: frontend/public/assets/generated/netflix-logo.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/spotify-logo.dim_512x512.png",
          "operation": "modify",
          "description": "Replace/update the generated Spotify logo file to the official high-resolution branding asset: frontend/public/assets/generated/spotify-logo.dim_512x512.png."
        },
        {
          "path": "frontend/public/assets/generated/youtube-logo.dim_512x512.png",
          "operation": "modify",
          "description": "Replace/update the generated YouTube Premium branding logo file: frontend/public/assets/generated/youtube-logo.dim_512x512.png."
        },
        {
          "path": "frontend/src/components/ProductGrid.tsx",
          "operation": "modify",
          "description": "Ensure Netflix, Spotify, and YouTube Premium product entries reference the updated static generated logo paths under /assets/generated (no remote runtime logos) and keep those references consistent."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Ensure consistent product-card interactions: quantity +/- reliability (min 1) and Buy It Now WhatsApp flow for priced products with English pre-filled message, without changing the premium dark styling; keep unpriced inquiry flow intact.",
      "acceptanceCriteria": [
        "All product cards retain consistent premium dark styling (cards, badges, typography, and buttons).",
        "Quantity decrement never goes below 1; increment always increases quantity.",
        "For priced products, “Buy It Now” opens `https://wa.me/8801326060586?text=...` in a new tab with an English pre-filled message including Product, Duration, Quantity, and Total.",
        "For unpriced products, the existing WhatsApp inquiry flow remains functional and does not show numeric pricing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Normalize quantity control logic for all products (enforce minimum quantity 1 and reliable increment/decrement), and ensure Buy It Now opens WhatsApp using https://wa.me/8801326060586 with an English message containing Product, Duration, Quantity, and Total for priced products while keeping the unpriced inquiry flow free of numeric pricing."
        },
        {
          "path": "frontend/src/components/CartDrawer.tsx",
          "operation": "modify",
          "description": "Ensure the WhatsApp checkout message uses the same English field structure (Product, Duration, Quantity, Total) and does not regress styling or behavior; unpriced products should not appear with numeric pricing."
        }
      ]
    }
  ]
}